# Numbering Schema Remove Gaps Method

Source: https://www.revitapidocs.com/2026/a97a1aff-4afe-7aa7-098a-f71229efdccd.htm

---

| Numbering Schema Remove Gaps Method |
| --- |

Removes gaps, if any, in a numbering sequence
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void RemoveGaps(
	string partition
)
```

```
Public Sub RemoveGaps (
	partition As String
)
```

```
public:
void RemoveGaps(
	String^ partition
)
```

```
member RemoveGaps :
        partition : string -> unit
```

#### Parameters

partition String
:   Name of the partition that identifies the sequence. The sequence must exist.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The sequence partition does not exist in the schema. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | Either the schema or its document cannot be modified at present.  \-or\-  Can't access the number while an async operation is running. |

Remarks Gaps are removed by shifting numbers above each gap down by the amount of
 numbers skipped in the gap. The lowest number in the sequence will remain unchanged. See Also

#### Reference

NumberingSchema Class Autodesk.Revit.DB Namespace